CSI API ETABS v1
cAreaElm.GetLoadUniform Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadUniform(
	string Name,
	ref int NumberItems,
	ref string[] AreaName,
	ref string[] LoadPat,
	ref string[] CSys,
	ref int[] Dir,
	ref double[] Value,
	eItemTypeElm ItemTypeElm = eItemTypeElm.Element
)
Function GetLoadUniform (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef AreaName As String(),
	ByRef LoadPat As String(),
	ByRef CSys As String(),
	ByRef Dir As Integer(),
	ByRef Value As Double(),
	Optional ItemTypeElm As eItemTypeElm = eItemTypeElm.Element
) As Integer
Dim instance As cAreaElm
Dim Name As String
Dim NumberItems As Integer
Dim AreaName As String()
Dim LoadPat As String()
Dim CSys As String()
Dim Dir As Integer()
Dim Value As Double()
Dim ItemTypeElm As eItemTypeElm
Dim returnValue As Integer
returnValue = instance.GetLoadUniform(Name,
	NumberItems, AreaName, LoadPat, CSys,
	Dir, Value, ItemTypeElm)
int GetLoadUniform(
	String^ Name,
	int% NumberItems,
	array<String^>^% AreaName,
	array<String^>^% LoadPat,
	array<String^>^% CSys,
	array<int>^% Dir,
	array<double>^% Value,
	eItemTypeElm ItemTypeElm = eItemTypeElm::Element
)
abstract GetLoadUniform :
        Name : string *
        NumberItems : int byref *
        AreaName : string[] byref *
        LoadPat : string[] byref *
        CSys : string[] byref *
        Dir : int[] byref *
        Value : float[] byref *
        ?ItemTypeElm : eItemTypeElm
(* Defaults:
        let _ItemTypeElm = defaultArg ItemTypeElm eItemTypeElm.Element
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
AreaName
Type: System.String[]
LoadPat
Type: System.String[]
CSys
Type: System.String[]
Dir
Type: System.Int32[]
Value
Type: System.Double[]
ItemTypeElm (Optional)
Type: ETABSv1.eItemTypeElm
Return Value
Type: Int32
See Also
Reference
cAreaElm Interface
ETABSv1 Namespace